; domain
(define (domain ranchyard)
(:requirements :typing :fluents)
(:types range range_asset - object
  homestead outpost - range
        wagon lariat platform - range_asset
        skid bale - platform)

(:predicates (grazing_at ?x - range_asset ?y - range)
             (stacked_on ?x - bale ?y - platform)
             (loaded_in ?x - bale ?y - wagon)
             (hauling ?x - lariat ?y - bale)
             (ready ?x - lariat)
             (bare ?x - platform)
)

(:functions
  (wagon_cap ?t - wagon)
  (current_haul ?t - wagon)
  (mass ?c - bale)
  (feed-cost)
)

(:action mosey
:parameters (?x - wagon ?y - range ?z - range)
:precondition (and (grazing_at ?x ?y))
:effect (and (not (grazing_at ?x ?y)) (grazing_at ?x ?z)
    (increase (feed-cost) 10)))

(:action rope_up
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (ready ?x) (grazing_at ?y ?p) (stacked_on ?y ?z) (bare ?y))
:effect (and (not (grazing_at ?y ?p)) (hauling ?x ?y) (not (bare ?y)) (not (ready ?x))
             (bare ?z) (not (stacked_on ?y ?z)) (increase (feed-cost) 1)))

(:action rope_down
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (bare ?z) (hauling ?x ?y))
:effect (and (ready ?x) (not (hauling ?x ?y)) (grazing_at ?y ?p) (not (bare ?z)) (bare ?y)
    (stacked_on ?y ?z)))

(:action wrangle_in
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (hauling ?x ?y)
    (<= (+ (current_haul ?z) (mass ?y)) (wagon_cap ?z)))
:effect (and (not (hauling ?x ?y)) (loaded_in ?y ?z) (ready ?x)
    (increase (current_haul ?z) (mass ?y))))

(:action wrangle_out
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (ready ?x) (loaded_in ?y ?z))
:effect (and (not (loaded_in ?y ?z)) (not (ready ?x)) (hauling ?x ?y)
    (decrease (current_haul ?z) (mass ?y))))

)

; problem
(define (problem depotprob5656) (:domain ranchyard)
(:objects
	homestead0 - homestead
	outpost0 outpost1 - outpost
	wagon0 wagon1 - wagon
	skid0 skid1 skid2 - skid
	bale0 bale1 bale2 bale3 bale4 - bale
	lariat0 lariat1 lariat2 - lariat)
(:init
	(grazing_at skid0 homestead0)
	(bare bale1)
	(grazing_at skid1 outpost0)
	(bare bale4)
	(grazing_at skid2 outpost1)
	(bare bale2)
	(grazing_at wagon0 outpost1)
	(= (current_haul wagon0) 0)
	(= (wagon_cap wagon0) 295)
	(grazing_at wagon1 homestead0)
	(= (current_haul wagon1) 0)
	(= (wagon_cap wagon1) 268)
	(grazing_at lariat0 homestead0)
	(ready lariat0)
	(grazing_at lariat1 outpost0)
	(ready lariat1)
	(grazing_at lariat2 outpost1)
	(ready lariat2)
	(grazing_at bale0 outpost1)
	(stacked_on bale0 skid2)
	(= (mass bale0) 89)
	(grazing_at bale1 homestead0)
	(stacked_on bale1 skid0)
	(= (mass bale1) 62)
	(grazing_at bale2 outpost1)
	(stacked_on bale2 bale0)
	(= (mass bale2) 42)
	(grazing_at bale3 outpost0)
	(stacked_on bale3 skid1)
	(= (mass bale3) 37)
	(grazing_at bale4 outpost0)
	(stacked_on bale4 bale3)
	(= (mass bale4) 11)
	(= (feed-cost) 0)
)

(:goal (and
		(stacked_on bale0 skid1)
		(stacked_on bale2 skid0)
		(stacked_on bale3 bale4)
		(stacked_on bale4 skid2)
	)
)

(:metric minimize (total-time)))

; plan
1. (rope_up lariat0 bale1 skid0 homestead0)
   deleted: (grazing_at bale1 homestead0) (bare bale1) (ready lariat0) (stacked_on bale1 skid0)
   added: (hauling lariat0 bale1) (bare skid0)
   changed: (feed-cost) from 0 to 1
   goals met: 0 of 4
2. (wrangle_in lariat0 bale1 wagon1 homestead0)
   deleted: (hauling lariat0 bale1)
   added: (loaded_in bale1 wagon1) (ready lariat0)
   changed: (current_haul wagon1) from 0 to 62
   goals met: 0 of 4
3. (rope_up lariat2 bale2 bale0 outpost1)
   deleted: (grazing_at bale2 outpost1) (bare bale2) (ready lariat2) (stacked_on bale2 bale0)
   added: (hauling lariat2 bale2) (bare bale0)
   changed: (feed-cost) from 1 to 2
   goals met: 0 of 4
4. (wrangle_in lariat2 bale2 wagon0 outpost1)
   deleted: (hauling lariat2 bale2)
   added: (loaded_in bale2 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 0 to 42
   goals met: 0 of 4
5. (rope_up lariat2 bale0 skid2 outpost1)
   deleted: (grazing_at bale0 outpost1) (bare bale0) (ready lariat2) (stacked_on bale0 skid2)
   added: (hauling lariat2 bale0) (bare skid2)
   changed: (feed-cost) from 2 to 3
   goals met: 0 of 4
6. (wrangle_in lariat2 bale0 wagon0 outpost1)
   deleted: (hauling lariat2 bale0)
   added: (loaded_in bale0 wagon0) (ready lariat2)
   changed: (current_haul wagon0) from 42 to 131
   goals met: 0 of 4
7. (mosey wagon0 outpost1 outpost0)
   deleted: (grazing_at wagon0 outpost1)
   added: (grazing_at wagon0 outpost0)
   changed: (feed-cost) from 3 to 13
   goals met: 0 of 4
8. (mosey wagon1 homestead0 outpost1)
   deleted: (grazing_at wagon1 homestead0)
   added: (grazing_at wagon1 outpost1)
   changed: (feed-cost) from 13 to 23
   goals met: 0 of 4
9. (mosey wagon0 outpost0 homestead0)
   deleted: (grazing_at wagon0 outpost0)
   added: (grazing_at wagon0 homestead0)
   changed: (feed-cost) from 23 to 33
   goals met: 0 of 4
10. (wrangle_out lariat0 bale2 wagon0 homestead0)
   deleted: (loaded_in bale2 wagon0) (ready lariat0)
   added: (hauling lariat0 bale2)
   changed: (current_haul wagon0) from 131 to 89
   goals met: 0 of 4
11. (mosey wagon0 homestead0 outpost0)
   deleted: (grazing_at wagon0 homestead0)
   added: (grazing_at wagon0 outpost0)
   changed: (feed-cost) from 33 to 43
   goals met: 0 of 4
12. (rope_down lariat0 bale2 skid0 homestead0)
   deleted: (hauling lariat0 bale2) (bare skid0)
   added: (ready lariat0) (grazing_at bale2 homestead0) (bare bale2) (stacked_on bale2 skid0)
   goals met: 1 of 4
13. (mosey wagon1 outpost1 homestead0)
   deleted: (grazing_at wagon1 outpost1)
   added: (grazing_at wagon1 homestead0)
   changed: (feed-cost) from 43 to 53
   goals met: 1 of 4
14. (wrangle_out lariat0 bale1 wagon1 homestead0)
   deleted: (loaded_in bale1 wagon1) (ready lariat0)
   added: (hauling lariat0 bale1)
   changed: (current_haul wagon1) from 62 to 0
   goals met: 1 of 4
15. (mosey wagon1 homestead0 outpost1)
   deleted: (grazing_at wagon1 homestead0)
   added: (grazing_at wagon1 outpost1)
   changed: (feed-cost) from 53 to 63
   goals met: 1 of 4
16. (mosey wagon0 outpost0 homestead0)
   deleted: (grazing_at wagon0 outpost0)
   added: (grazing_at wagon0 homestead0)
   changed: (feed-cost) from 63 to 73
   goals met: 1 of 4
17. (wrangle_in lariat0 bale1 wagon0 homestead0)
   deleted: (hauling lariat0 bale1)
   added: (loaded_in bale1 wagon0) (ready lariat0)
   changed: (current_haul wagon0) from 89 to 151
   goals met: 1 of 4
18. (mosey wagon0 homestead0 outpost0)
   deleted: (grazing_at wagon0 homestead0)
   added: (grazing_at wagon0 outpost0)
   changed: (feed-cost) from 73 to 83
   goals met: 1 of 4
19. (mosey wagon1 outpost1 outpost1)
   changed: (feed-cost) from 83 to 93
   goals met: 1 of 4
20. (rope_up lariat1 bale4 bale3 outpost0)
   deleted: (grazing_at bale4 outpost0) (bare bale4) (ready lariat1) (stacked_on bale4 bale3)
   added: (hauling lariat1 bale4) (bare bale3)
   changed: (feed-cost) from 93 to 94
   goals met: 1 of 4
21. (wrangle_in lariat1 bale4 wagon0 outpost0)
   deleted: (hauling lariat1 bale4)
   added: (loaded_in bale4 wagon0) (ready lariat1)
   changed: (current_haul wagon0) from 151 to 162
   goals met: 1 of 4
22. (rope_up lariat1 bale3 skid1 outpost0)
   deleted: (grazing_at bale3 outpost0) (bare bale3) (ready lariat1) (stacked_on bale3 skid1)
   added: (hauling lariat1 bale3) (bare skid1)
   changed: (feed-cost) from 94 to 95
   goals met: 1 of 4
23. (wrangle_in lariat1 bale3 wagon0 outpost0)
   deleted: (hauling lariat1 bale3)
   added: (loaded_in bale3 wagon0) (ready lariat1)
   changed: (current_haul wagon0) from 162 to 199
   goals met: 1 of 4
24. (mosey wagon0 outpost0 outpost1)
   deleted: (grazing_at wagon0 outpost0)
   added: (grazing_at wagon0 outpost1)
   changed: (feed-cost) from 95 to 105
   goals met: 1 of 4
25. (wrangle_out lariat2 bale4 wagon0 outpost1)
   deleted: (loaded_in bale4 wagon0) (ready lariat2)
   added: (hauling lariat2 bale4)
   changed: (current_haul wagon0) from 199 to 188
   goals met: 1 of 4
26. (rope_down lariat2 bale4 skid2 outpost1)
   deleted: (hauling lariat2 bale4) (bare skid2)
   added: (ready lariat2) (grazing_at bale4 outpost1) (bare bale4) (stacked_on bale4 skid2)
   goals met: 2 of 4
27. (wrangle_out lariat2 bale3 wagon0 outpost1)
   deleted: (loaded_in bale3 wagon0) (ready lariat2)
   added: (hauling lariat2 bale3)
   changed: (current_haul wagon0) from 188 to 151
   goals met: 2 of 4
28. (mosey wagon0 outpost1 outpost0)
   deleted: (grazing_at wagon0 outpost1)
   added: (grazing_at wagon0 outpost0)
   changed: (feed-cost) from 105 to 115
   goals met: 2 of 4
29. (wrangle_out lariat1 bale0 wagon0 outpost0)
   deleted: (loaded_in bale0 wagon0) (ready lariat1)
   added: (hauling lariat1 bale0)
   changed: (current_haul wagon0) from 151 to 62
   goals met: 2 of 4
30. (rope_down lariat1 bale0 skid1 outpost0)
   deleted: (hauling lariat1 bale0) (bare skid1)
   added: (ready lariat1) (grazing_at bale0 outpost0) (bare bale0) (stacked_on bale0 skid1)
   goals met: 3 of 4
31. (rope_down lariat2 bale3 bale4 outpost1)
   deleted: (hauling lariat2 bale3) (bare bale4)
   added: (ready lariat2) (grazing_at bale3 outpost1) (bare bale3) (stacked_on bale3 bale4)
   goals met: 4 of 4
